const question = document.getElementById("question");
const questionNumber = document.getElementById("question-number");
const choices = Array.from(document.getElementsByClassName("choice-text"));
const progressBarFull = document.getElementById("progressBarFull");
const progressBar = document.getElementById("progressBar");
const previousQuestionBtn = document.getElementById("previousQuestionBtn");
const choice1 = document.getElementById("choice1");
const choice2 = document.getElementById("choice2");
const choice3 = document.getElementById("choice3");

let currentQuestion = {};
let acceptingAnswers = false;
let score = 0;
let questionCounter = 0;
let availableQuestions = [];
let answers = [];
var answerCounter = 0;

for (var i = 0; i < 90; i++) {
  answers.push(0);
}

let questions = [
  "وقتی با مسئله خیلی دشواری روبرو می‌شوید معمولا چه می‌کنید؟",
  "اگر سرگرم ساختن وسیله‌ای باشید و ناگهان دریابید که قطعه مهمی از آن را گم کرده‌اید، چه می‌کنید؟",
  "وقتی در مکانی عمومی هستید آیا هرگز سعی می‌کنید حدس بزنید افرادی که دور از شما هستند درباره چه چیزی بحث می‌کنند؟",
  "آیا از حل مسائل دشوار لذت می‌برید؟",
  "اگر عضو گروهی باشید که باید مسئله‌ای را با همکاری حل‌کنند، چه می‌کنید؟",
  "وقتی با مسئله تازه‌ای روبه‌رو می‌شوید، معمولا چه می‌کنید؟",
  "اگر درگیر حل یک مسئله یا مشکل ریاضی باشید، چه می‌کنید؟",
  "وقتی در گروهی برای حل مسئله در یک گروه کار می‌کنید، اعضای گروه چگونه از نظرات مبتکرانه شما استقبال می‌کنند؟",
  "وقتی با مشکل غیرعادی مواجه می‌شوید، معمولا آن را چگونه رفع می‌کنید؟",
  "آیا به نظر دیگران شما سؤالات مشکلی مطرح می‌کنید؟",
  "آیا معمولا دوست دارید به کارهای تازه دست بزنید؟",
  "وقتی با مسئله پیچیده‌ای روبه‌رو می‌شوید، چه می‌کنید؟",
  "آیا از تجارب تازه لذت می‌برید؟",
  "وقتی در موقعیتی قرار می‌گیرید که از عهده آن بر نمی‌آیید، چقدر به دیگران متوسل می‌شوید؟",
  "به آنچه مستقلا انجام می‌دهید چقدر اطمینان دارید؟",
  "آیا از انجام دادن آزمایش‌های علمی لذت می‌برید؟",
  "آیا هرگز در رویا فرو رفته‌اید؟",
  "در بیان مطالب خود با چه سهولتی از کلمات استفاده می‌کنید؟",
  "بیان شما تا چه اندازه خوب است؟",
  "نوشتن شما تا چه اندازه خوب است؟",
  "اگر عده‌ای از افراد به نحوی غیر منتظره از شما بخواهند بیش از پنج دقیقه درباره موضوعی صحبت کنید، تا چه اندازه از عهده این کار برخواهید آمد؟",
  "برای توصیف یک مطلب با موضوع با چه سهولتی به کلمات دست پیدا می‌کنید؟",
  "آیا به شغلی علاقه دارید که مستلزم فراهم ساختن اندیشه‌های بسیار باشد؟",
  "برای بیان یک اندیشه با چه سهولتی به کلمات مترادف دست پیدا می‌کنید؟",
  'اگر به ناچار در مسابقه‌ای شرکت کنید که در آن باید تا حد امکان کلمه‌های بسیاری را که با حرف "ج" شروع می‌شوند بیان نمایید، تا چه اندازه از عهده این کار بر می‌آیید؟',
  "اگر از شما خواسته شود در مسابقه‌ای شرکت کنید که در آن باید اسامی متعلق به یک طبقه معین از اشیاء و امور مانند غذاها و گیاهان را نام ببرید، تا چه اندازه از عهده این کار بر می‌آیید؟",
  'چند جمله می‌توانید بنویسید که همه آنها با کلمه "همه" شروع شود؟',
  "آیا می‌توانید غیر از کاربرد معمولی اشیاء، موارد استفاده دیگری را نیز برای آن پیدا کنید؟",
  "نوشتن تعداد زیادی داستان تا چه حد برایتان آسان است؟",
  "کدام یک از موارد زیر برایتان آسان‌تر است؟",
  "اگر از شما خواسته شود تا درباره جامعه خود مقاله‌ای برای روزنامه بنویسید، چه می‌کنید؟",
  "از کدام مورد زیر بیشترین لذت را می‌برید؟",
  "آیا در طراحی اسباب بازی‌های جدید برای کودکان موفق خواهید بود؟",
  "اگر به جای معلم به کلاس کودکستان بروید و طرح درس نداشته باشید، تا چه اندازه از عهده آن بر می‌آیید؟",
  'نوشتن مترادف‌های بسیار برای کلمه‌ی "سریع" چقدر برایتان آسان است؟',
  "فرض کنیم همه راه‌های معمولی برای گرم‌کردن غذا را از دست داده‌ایم، در اینصورت تهیه فهرستی طولانی از راه‌های دیگر برای گرم‌کردن غذا چقدر برایتان آسان است؟",
  "اگر ناچار به ایراد سخنرانی باشید، تا چه اندازه از عهده آن بر می‌آیید؟",
  "اگر با گروهی از دوستانتان باشید و آنان از شما بخواهند درباره موضوعی که در آن تجربه دارید یک ساعت صحبت کنید، در این موقعیت چه کار می‌کنید؟",
  "آیا به شغلی علاقه‌مند هستید که مستلزم سرهم‌کردن داستان در مقابل شنوندگان باشد؟",
  "وقتی ناچار باشید با فردی که زبان فارسی را خوب بلد نیست ارتباط برقرارکنید، یافتن راه‌های ساده‌تر برای بیان مطلب خود به فارسی تا چه اندازه برایتان آسان است؟",
  "چقدر از ساختن چیزهای جدید لذت می‌برید؟",
  "با افرادی که به سختی متقاعد می‌شوند چگونه برخورد می‌کنید؟",
  "وقتی می‌خواهید کار پیچیده‌ای را انجام دهید، معمولا کدام روش را برمی‌گزینید؟",
  "چه نوع کاری را بیشتر دوست دارید؟",
  "آیا توضیح دلایل رفتار پیچیده مانند رفتار یک کودک به هنجار برای شما دشوار است؟",
  "اگر به یک همایش دعوت شوید تا مسائل جامعه خود را مورد بحث قرار دهید، تهیه فهرستی طولانی از مسائل آن چقدر برایتان دشوار است؟",
  "اگر از شما دعوت شود تا جهت دریافت کمک مالی به انجمن شهر بروید و پیشنهاد‌هایی ارائه دهید، تا چه اندازه از عهده آن برمی‌آیید؟",
  "آیا می‌توانید به یک معلم کلاس اول کمک کنید تا راه‌های گوناگون بسیاری برای آموزش اعداد بیابید بطوری که دانش‌آموزان به فراگیری اعداد علاقه‌مند شوند؟",
  "کمک فکری به مدرسه برای ایجاد امکانات ورزشی و سرگرمی چقدر برای شما آسان است؟",
  "وقتی حادثه غیرعادلانه برای شما رخ دهد آیا سعی می‌کنید به عوامل مختلفی که احتمالا در آن دخالت داشته‌اند پی‌ببرید؟",
  "وقتی حادثه عجیبی رخ می‌دهد، معمولا چه می‌کنید؟",
  "وقتی به چیزی علاقه‌مند می‌شوید، چقدر به جزئیات آن توجه می‌کنید؟",
  "وقتی به یک آواز گوش می‌کنید، چقدر به محتوای آن توجه می‌کنید؟",
  "وقتی به یک اثر هنری نگاه می‌کنید، آیا به آنچه هنرمند سعی دارد بگوید توجه می‌کنید؟",
  "وقتی یک نمایش بدون کلام (پانتومیم) تماشا می‌کنید چه واکنشی نشان می‌دهید؟",
  "پس از تماشای فیلمی که شما را تحت تاثیر قرارداده است، معمولا چه می‌کنید؟",
  "وقتی نامه‌ای می‌نویسید، معمولا چه مطالبی در آن می‌گنجانید؟",
  "وقتی کتابی می‌خوانید آیا آنچه را که می‌خوانید در ذهن خود مجسم می‌کنید؟",
  "در آنچه انجام می‌دهید از چه مقدار پیچیدگی لذت می‌برید؟",
  "چقدر به جزئیات کاری که انجام می‌دهید می‌پردازید؟",
];

//CONSTANTS

const MAX_QUESTION = 60;

startTest = () => {
  questionCounter = 0;
  score = 0;
  getNewQuestion();
};

getNewQuestion = () => {
  if (questions.length === 0 || questionCounter >= MAX_QUESTION) {
    const body = {
      answerData: answers,
    };
    const string = JSON.stringify(body);

    fetch("/tests/answerDataCT", {
      method: "PATCH",
      headers: {
        "Content-Type": "application/json",
      },
      body: string,
    })
      .then((res) => res.json())
      .then((data) => {
        if (data.ok) {
          window.location.assign("/dashboard");
        } else {
          alert("اروری اتفاق افتاد ");
        }
      })
      .catch((err) => {
        console.log(err);
        alert("اروری اتفاق افتاد ");
      });
  }
  if (questionCounter < 1) {
    previousQuestionBtn.style.visibility = "hidden";
  }
  if (questionCounter >= 1) {
    previousQuestionBtn.style.visibility = "visible";
  }

  //filling the progress bar
  let progressBarFullWidth = (questionCounter / MAX_QUESTION) * 100 + "%";
  progressBarFull.style.width = progressBarFullWidth;

  choice1.innerText = eleven[answerCounter];
  choice2.innerText = eleven[answerCounter + 1];
  choice3.innerText = eleven[answerCounter + 2];
  answerCounter += 3;

  //new text and number
  question.innerText = questions[questionCounter];
  questionNumber.innerText = questionCounter + 1;

  questionCounter++;

  acceptingAnswers = true;
};

choices.forEach((choice) => {
  choice.addEventListener("click", (e) => {
    if (!acceptingAnswers) return;

    acceptingAnswers = false;
    const selectedChoice = e.target;

    switch (selectedChoice.id) {
      case "choice1":
        answers[questionCounter - 1] = 6;
        break;
      case "choice2":
        answers[questionCounter - 1] = 5;
        break;
      case "choice3":
        answers[questionCounter - 1] = 4;
        break;
      case "choice4":
        answers[questionCounter - 1] = 3;
        break;
      case "choice5":
        answers[questionCounter - 1] = 2;
        break;
      case "choice6":
        answers[questionCounter - 1] = 1;
        break;
    }

    selectedChoice.parentElement.classList.add("chosen");

    setTimeout(() => {
      selectedChoice.parentElement.classList.remove("chosen");
      getNewQuestion();
    }, 250);
  });
});

previousQuestionBtn.addEventListener("click", (e) => {
  questionCounter -= 2;
  answerCounter -= 6;
  getNewQuestion();
});

//New Answer
let eleven = [
  "گریه می‌کنم چون فکر نمی‌کنم بتوانم مسئله را حل کنم",
  "گریه نمی‌کنم اما ناراحت می‌شوم",
  "سعی می‌کنم راهنمایی مناسبی برای حل مسئله بیابم",
  "کار را متوقف می‌کنم",
  "سعی می‌کنم قطعه گم‌شده را پیدا کنم و اگر نتوانستم آن را پیدا کنم کار را متوقف می‌کنم",
  "سعی می‌کنم قطعه گم شده را پیدا کنم و اگر نتوانستم آن را پیدا کنم به جای آن قطعه دیگری می‌سازم",
  "هرگز علاقه مند نیستم حدس بزنم دیگران درباره چه چیزی بحث می‌کنند",
  "گاهی دوست دارم حدس بزنم دیگران درباره چه چیزی بحث می‌کنند",
  "همیشه دوست دارم حدس بزنم دیگران درباره چه چیزی بحث می‌کنند",
  "خیر از حل مسائل دشوار لذت نمی‌برم",
  "گاهی از حل مسائل دشوار لذت می‌برم",
  "اغلب از حل مسائل دشوار لذت می‌برم",
  "خودم کاری نمی‌کنم و می‌گذارم دیگر اعضای گروه مسئله را حل کنند",
  "گاهی در آنچه گروه انجام می‌دهد شرکت می‌کنم",
  "به طور فعال در آنچه گروه انجام می‌دهد شرکت می‌کنم",
  "از فرد دیگری می‌خواهم آن را برایم حل کند",
  "سعی می‌کنم با کمک فرد دیگری آن را حل کنم",
  "سعی می‌کنم اطلاعات بیشتری بدست آورم تا بتوانم خودم آن را حل کنم",
  "از استاد (معلم) یا شخص دیگری می‌خواهم به من کمک کند",
  "یک کتاب ریاضی مربوط به مسئله را می‌خوانم",
  "از همه منابعی که در دسترس دارم استفاده می‌کنم",
  "به ندرت از نظرات مبتکرانه من استقبال می‌کنند",
  "گاهی از نظرات مبتکرانه من استقبال می‌کنند",
  "اغلب از نظرات مبتکرانه من استقبال می‌کنند",
  "اغلب از افراد دیگری کمک می‌گیرم",
  "قبل از آن که از فرد دیگری کمک بگیرم مدت کوتاهی تلاش می‌کنم با خودم آن را حل کنم",
  "مدتی بسیار طولانی تلاش می‌کنم تا خودم آن را حل کنم",
  "خیر این طور فکر نمی‌کنند",
  "گاهی این طور فکر می‌کنند",
  "اغلب این طور فکر می‌کنند",
  "معمولا به کارهای تازه دست نمی‌زنم",
  "گاهی به کارهای تازه دست می‌زنم",
  "اغلب به کارهای تازه دست می‌زنم",
  "سعی می‌کنم خود را درگیر حل آن نکنم",
  "ممکن است زمان کوتاهی برای حل آن تلاش کنم",
  "زمانی بسیار طولانی برای حل آن تلاش می‌کنم",
  "از تجارب تازه لذت نمی‌برم",
  "گاهی از تجارب تازه لذت می‌برم",
  "همواره از تجارب تازه لذت می‌برم",
  "اغلب به دیگران متوسل می‌شوم",
  "گاهی به دیگران متوسل می‌شوم",
  "معمولا ترجیح می‌دهم به خودم متکی باشم",
  "به آنچه خودم مستقلا انجام می‌دهم اطمینان زیادی ندارم",
  "به آنچه خودم مستقلا انجام می‌دهم تا حدودی اطمینان دارم",
  "به آنچه خودم مستقلا انجام می‌دهم اطمینان زیادی دارم",
  "از انجام دادن آزمایش لذت نمی‌برم",
  "از انجام دادن آزمایش تا حدودی لذت می‌برم",
  "از انجام دادن آزمایش خیلی لذت می‌برم",
  "خیر من در رویا فرو نمی‌روم",
  "اگر وقت داشته‌باشم گاهی در رویا فرو می‌روم",
  "اغلب اگر وقت داشته‌باشم در رویا فرو می‌روم",
  "معمولا اشکال دارم",
  "گاهی اشکال دارم",
  "به ندرت اشکال دارم",
  "مطالبم را به خوبی بیان نمی‌کنم",
  "گاهی مطالبم را به خوبی بیان نمی‌کنم",
  "اغلب مطالبم را به خوبی بیان می‌کنم",
  "در نوشتن نظراتم اشکال دارم",
  "شاید بتوانم نظراتم را بنویسم",
  "کاملا می‌توانم نظراتم را بنویسم",
  "از عهده‌اش برنخواهم آمد زیرا برای آن آمادگی نداشتم",
  "نهایت سعی خود را خواهم کرد تا از عهده آن برآیم",
  "به خوبی از عهده آن برخواهم آمد",
  "معمولا برایم این کار دشوا است",
  "در نهایت گاهی این کار برایم آسان است",
  "اغلب این کار برایم آسان است",
  "علاقه‌مند نخواهم بود",
  "شاید علاقه‌مند باشم",
  "علاقه‌مند خواهم بود",
  "معمولا این کار برایم دشوار است",
  "گاهی این کار برایم آسان است",
  "اغلب این کار برایم آسان است",
  "چندان از عهده این کار بر نمی‌آیم",
  "تا اندازه‌ای از عهده این کار بر می‌آیم",
  "در حد خیلی زیادی از عهده این کار بر می‌آیم",
  "چندان از عهده این کار بر نمی‌آیم",
  "تا اندازه‌ای از عهده این کار بر می‌آیم",
  "در حد خیلی زیادی از عهده این کار بر می‌آیم",
  "می‌توانم فقط چند جمله بنویسم",
  "می‌توانم تعدادی جمله بنویسم",
  "می‌توانم تعداد زیادی جمله بنویسم",
  "این کار برایم خیلی دشوار است",
  "شاید بتوانم چند مورد استفاده دیگر پیدا کنم",
  "می‌توانم موارد استفاده بسیاری پیدا کنم",
  "این کار برایم خیلی دشوار است",
  "می‌توانم چند داستان بنویسم",
  "می‌توانم داستان‌های بسیاری بنویسم",
  "حفظ یک شعر ده بیتی",
  "تفسیر یک شعر ده بیتی",
  "سرودن یک شعر ده بیتی",
  "آنچه را که پیش از آن درباره جامعه‌ام نوشته‎ام، خلاصه می‌کنم",
  "بر آنچه که پیش از این درباره جامعه‌ام نوشته‌ام، اطلاعات دیگری می‌افزایم",
  "پس از مطالعه مطالبی که پیش از آن درباره جامعه‌ام نوشته شده‌است، به نوشتن مقاله خود اقدام می‌کنم",
  "از مطالعه کتاب‌های معروف لذت می‌برم",
  "از مطالعه کتاب‌های معروف و نوشتن چند کتاب توسط خودم لذت می‌برم",
  "از نوشتن کتاب‌های خودم لذت می‌برم",
  "چندان موفق نخواهم بود",
  "شاید بتوانم چند طرح را ارائه کنم",
  "می‌توانم طرح‌های بسیاری را ارائه کنم",
  "شکست خواهم خورد",
  "مشکل خواهم داشت",
  "موفق خواهم شد",
  "این کار برایم خیلی دشوار است",
  "این کار تا اندازه‌ای برایم دشوار است",
  "این کار برایم آسان است",
  "این کار برایم خیلی دشوار است",
  "این کار تا اندازه‌ای برایم دشوار است",
  "این کار برایم آسان است",
  "به طور کامل از روی یادداشت‌هایم می‌خوانم",
  "بیشتر از روی یادداشت‌هایم می‌خوانم",
  "گاهی به یادداشت‌هایم نگاه می‌کنم",
  "سعی میکنم از صحبت‌کردن درباره آن خودداری کنم",
  "می‌توانم فکر کنم و مطالبی بگویم",
  "میتوانم مدت طولانی درباره آن صحبت کنم",
  "علاقه‌مند نیستم",
  "تا حدودی علاقه‌مند هستم",
  "علاقه‌مند هستم",
  "معمولا این کار برایم دشوار است",
  "گاهی این کار برایم آسان است",
  "اغلب این کار برایم آسان است",
  "معمولا از ساختن چیزهای جدید لذت می‌برم",
  "گاهی از ساختن چیزهای جدید لذت می‌برم",
  "اغلب از ساختن چیزهای جدید لذت می‌برم",
  "در یافتن دلایل متقاعدکننده اشکال دارم",
  "سعی می‌کنم برای متقاعدکردن آنها دلایل مختلف بیابم",
  "برای متقاعدکردن آنان دلایل بسیار می‌یابم",
  "یک روش واحد می‌یابم",
  "شاید بتوانم چند روش بیابم",
  "می‌توانم روش‌های متنوعی بیابم",
  "کاری که تقریبا همه مراحل آن از پیش مشخص و معین شده باشد",
  "کاری که بخشی از آن مشخص شده و بخشی از آن نیازمند به ابتکار باشد",
  "کاری را که بیشتر مراحل آن نیازمند ابتکار باشد",
  "توضیح رفتار پیچیده برای من خیلی دشوار است",
  "می‌توانم توضیحات کلی ارائه دهم",
  "می‌توانم توضیحات بسیاری ارائه دهم",
  "خیلی دشوار است",
  "تا حدی دشوار است",
  "چندان هم دشوار نیست",
  "ارائه پیشنهادهایی فراتر از آنچه شورای شهر قبلا در نظرگرفته است، برایم دشوار است",
  "می‌توانم تعداد اندکی پیشنهاد فراتر از آنچه قبلا شورای شهر در نظرگرفته است، ارائه دهم",
  "می‌توانم پیشنهادهای زیادی فراتر از آنچه قبلا شورای شهر در نظرگرفته است، ارائه دهم",
  "خیر نمی‌توانم این کار را انجام دهم",
  "شاید بتوانم چند راه معدود ارائه دهم",
  "بله میتوانم راه‌های گوناگون بسیاری ارائه دهم",
  "خیلی دشوار است",
  "می‌توانم راه‌های جدید محدودی ارائه دهم",
  "بله می‌توانم راه‌های گوناگون بسیاری ارائه دهم",
  "سعی نمی‌کنم",
  "گاهی سعی می‌کنم",
  "معمولا سعی می‌کنم",
  "به آن توجه نمی‌کنم",
  "به جستجوی برخی علل اصلی آن می‌پردازم",
  "به جستجوی همه علل ممکن می‌پردازم",
  "زیاد به جزئیات آن توجه نمی‌کنم",
  "به جزئیات کلی آن توجه می‌کنم",
  "به همه جزئیات آن توجه می‌کنم",
  "هرگز توجه نمی‌کنم",
  "گاهی توجه می‌کنم",
  "خیلی توجه می‌کنم",
  "من به آنچه هنرمند سعی دارد بگوید نمی‌اندیشم",
  "گاهی اوقات به آنچه هنرمند سعی دارد بگوید می‌اندیشم",
  "اغلب به آنچه که هنرمند سعی دارد بگوید می‌اندیشم",
  "فقط برای لذت بردن تماشا می‌کنم",
  "آن را تماشا می‌کنم و سعی می‌کنم پیام عمومی آن را درک کنم",
  "آن را تماشا می‌کنم و سعی می‌کنم همه پیام‌های آن را درک کنم",
  "به کار بعدی خود می‌پردازم",
  "شاید درباره یک جنبه از فیلم با دیگران صحبت کنم",
  "درباره جنبه‌های فیلم فکر می‌کنم و درباره آن‌ها با دیگران صحبت می‌کنم",
  "درباره مطالبی می‌نویسم که دیگران به دانستن آن نیازمندند",
  "درباره مهمترین حوادث می‌نویسم",
  "درباره جزئیات زندگی خودم می‌نویسم",
  "آنچه را می‌خوانم در ذهن خود مجسم نمی‌کنم",
  "آنچه را می‌خوانم گاهی در ذهن مجسم می‌کنم",
  "همه آنچه را می‌خوانم مجسم می‌کنم",
  "از انجام دادن امور ساده و سر راست لذت می‌برم",
  "از انجام دادن امور تا حدودی پیچیده لذت می‌برم",
  "از انجام دادن امور بسیار پیچیده لذت می‌برم",
  "به ندرت به جزئیات می‌پردازم",
  "گاهی به جزئیات می‌پردازم",
  "اغلب به جزئیات می‌پردازم",
];

//calculating results

startTest();
