const question = document.getElementById("question");
const questionNumber = document.getElementById("question-number");
const choices = Array.from(document.getElementsByClassName("choice-text"));
const progressBarFull = document.getElementById("progressBarFull");
const progressBar = document.getElementById("progressBar");
const previousQuestionBtn = document.getElementById("previousQuestionBtn");
const choice1 = document.getElementById("choice1");
const choice2 = document.getElementById("choice2");

let currentQuestion = {};
let acceptingAnswers = false;
let score = 0;
let questionCounter = 0;
let availableQuestions = [];
let answers = [];
var answerCounter = 0;

for (var i = 0; i < 90; i++) {
  answers.push(0);
}

let questions = [
  "آیا شناختن شما",
  "آیا",
  "شما معمولا",
  "روابط دوستانه شما",
  "می‌توانید به طور نامحدود",
  "در صحبت کردن با دوستانتان",
  "آیا معمولا",
  "وقتی غریبه‌ها به شما توجه می‌کنند",
  "آیا عادت دارید",
  "آیا",
  "وقتی با گروهی از افراد هستید معمولا ترجیح می‌دهید",
  "در بین دوستانتان آیا",
  "در یک محفل اجتماعی",
  "در میهمانی‌ها",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "در یک مهمانی دوست دارید",
  "هنگامی که با گروهی از دوستان نزدیک خودتان هستید",
  "در یک گروه بزرگ اغلب",
  "زمانی که در مورد یک پیشامد فکر می‌کنید ترجیح می‌دهید",
  "آیا افرادی که تازه با شما آشنا می‌شوند می‌توانند بگویند به چه علاقه دارید؟",
  "آیا معمولا منظورتان",
  "وقتی که غریبه‌ها را مالقات می‌کنید",
  "وقتی در جلسه‌ای راجع به چیزی نظری دارید که باید گفته شود",
  "ترجیح می‌دهید در نظر مردم چگونه باشید؟",
  "هنگام مطالعه با هدف سرگرم شدن آیا",
  "اگر معلم بودید ترجیح می‌دادید",
  "معمولا با کدام شخص راحت‌تر ارتباط برقرار می‌کنید؟",
  "در انجام کاری که بسیاری از مردم انجام می‌دهند، ترجیح می‌دهید",
  "درشیوه‌ی زندگی‌تان ترجیح می‌دهید",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام یک تمجید بیشتری از یک فرد است؟",
  "اگر بخواهید در همسایگی خود برای مسائلی مانند کمک به کمیته امداد به جمع‌آوری اعانه بپردازید",
  "کدام گزاره تعریف و تمجید بیشتری از شما به شمار می‌آید؟",
  "آیا در تصمیم گیری، بیشتر",
  "هنگام گفتگو بیشتر تمایل دارید",
  "احساس می‌کنید که کدام یک عیب بدتری به شمار می‌آید؟",
  "اگر بخواهید عمل خاصی را انجام دهید کدام یک از این دو گزاره برایتان جالب‌تر بنظر می‌آید؟",
  "فکر می‌کنید وجود کدام یک در فرد نقص بیشتری است؟",
  "احساس می‌کنید کدام یک عیب بدتری به شمار می‌آید؟",
  "آیا معمولا",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "بیشتر مراقب کدام یک هستید؟",
  "آیا به طور طبیعی",
  "برای انجام یک کار، آیا",
  "هنگامی که رخدادی پیش‌بینی نشده شما را مجبور به کنار گذاشتن برنامه روزانه‌تان می‌نماید",
  "آیا مطابق برنامه عمل کردن",
  "هنگام شروع یک پروژه‌ی بزرگ که تا یک هفته باید انجام شود",
  "اگر قرار باشد که کاری خاص را از پیش در زمانی خاص انجام دهید",
  "آیا ترجیح می‌دهید",
  "آیا",
  "آیا فکر می‌کنید که داشتن یک برنامه روزانه",
  "وقتی که کار خاصی برای انجام دادن دارید آیا مایلید",
  "آیا",
  "در زندگی شخصی وقتی به پایان مسئولیتی می‌رسید",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "کدام لغت برای شما جالب‌تر است؟",
  "آیا به طور کلی ترجیح می‌دهید",
  "وقتی برای یک روز جایی می‌روید، آیا ترجیح می‌دهید ",
  "در مورد کارهای روز‌مره ترجیح می‌دهید",
  "آیا",
  "آیا در مورد معنی پرسش‌های این آزمون دوست داشتید",
];

//CONSTANTS

const MAX_QUESTION = 88;

startTest = () => {
  questionCounter = 0;
  score = 0;
  getNewQuestion();
};

getNewQuestion = () => {
  if (questions.length === 0 || questionCounter >= MAX_QUESTION) {
    const body = {
      answerData: answers,
    };
    const string = JSON.stringify(body);

    fetch("/tests/answerDataMBTI", {
      method: "PATCH",
      headers: {
        "Content-Type": "application/json",
      },
      body: string,
    })
      .then((res) => res.json())
      .then((data) => {
        if (data.ok) {
          window.location.assign("/dashboard");
        } else {
          alert("اروری اتفاق افتاد ");
        }
      })
      .catch((err) => {
        console.log(err);
        alert("اروری اتفاق افتاد ");
      });
  }
  if (questionCounter < 1) {
    previousQuestionBtn.style.visibility = "hidden";
  }
  if (questionCounter >= 1) {
    previousQuestionBtn.style.visibility = "visible";
  }

  //filling the progress bar
  let progressBarFullWidth = (questionCounter / MAX_QUESTION) * 100 + "%";
  progressBarFull.style.width = progressBarFullWidth;

  choice1.innerText = eleven[answerCounter];
  choice2.innerText = eleven[answerCounter + 1];
  answerCounter += 2;

  //new text and number
  question.innerText = questions[questionCounter];
  questionNumber.innerText = questionCounter + 1;

  questionCounter++;

  acceptingAnswers = true;
};

choices.forEach((choice) => {
  choice.addEventListener("click", (e) => {
    if (!acceptingAnswers) return;

    acceptingAnswers = false;
    const selectedChoice = e.target;

    switch (selectedChoice.id) {
      case "choice1":
        answers[questionCounter - 1] = 6;
        break;
      case "choice2":
        answers[questionCounter - 1] = 5;
        break;
      case "choice3":
        answers[questionCounter - 1] = 4;
        break;
      case "choice4":
        answers[questionCounter - 1] = 3;
        break;
      case "choice5":
        answers[questionCounter - 1] = 2;
        break;
      case "choice6":
        answers[questionCounter - 1] = 1;
        break;
    }

    selectedChoice.parentElement.classList.add("chosen");

    setTimeout(() => {
      selectedChoice.parentElement.classList.remove("chosen");
      getNewQuestion();
    }, 250);
  });
});

previousQuestionBtn.addEventListener("click", (e) => {
  questionCounter -= 2;
  answerCounter -= 4;
  getNewQuestion();
});

//New Answer
let eleven = [
  "آسان است؟",
  "دشوار است؟",
  "با هر کسی تا حدی که لازم می‌دانید به راحتی صحبت می‌کنید؟",
  "فقط با افراد خاصی آن هم در شرایط خاصی می‌توانید زیاد صحبت کنید؟",
  "زودجوش هستید؟",
  "آرام و درون‌گرا هستید؟",
  "با افرادی معدود ولی عمیق است؟",
  "با تعداد بسیاری از افراد ولی سطحی است؟",
  "فقط با کسانی که علایق مشترکی با شما دارند صحبت کنید؟",
  "می‌توانید تقریبا با هرکسی صحبت کنید؟",
  "گاهی مسائل شخصی را به طور خصوصی به آنان می‌گویید؟",
  "تقریبا هرگز چیزی را که نمی‌خواهید بگویید بیان نمی‌کنید؟",
  "آزادانه احساسات خود را نشان می‌دهید؟",
  "احساسات خود را نشان نمی‌دهید؟",
  "احساس ناراحتی می‌کنید؟",
  "اصلا ناراحت نمی‌شوید؟",
  "به هیچ‌کس اعتماد نکنید یا حداکثر به یک نفر اعتماد کنید؟",
  "تعدادی دوست دارید که به آن‌ها اعتماد می‌کنید؟",
  "فکر می‌کنید همه‌ی کسانی را که دوست دارید، می‌دانند که دوستشان دارید؟",
  "به بعضی افراد علاقه‌مند هستید بی‌آنکه بگذارید آن‌ها بدانند؟",
  "به صحبت گروهی بپردازید؟",
  "هر بار فقط با یک فرد صحبت کنید؟",
  "یکی از آخرین کسانی هستید که خبرها را می‌شنوید؟",
  "همه نوع خبری در مورد هر کسی دارید؟",
  "سعی می‌کنید کسی را که دوست دارید با او صحبت کنید به گوشه‌ای بکشید؟",
  "با گروه می‌جوشید؟",
  "گاهی کسل می‌شوید؟",
  "همیشه به شما خوش می‌گذرد؟",
  "صحبت کردن",
  "نوشتن",
  "آرام",
  "سرزنده ",
  "ساکت",
  "پرحرف",
  "کاری کنید که مراسم به خوبی برگزار شود؟",
  "می‌گذارید هر کسی به میل خودش خوش بگذراند؟",
  "بیشتر از بقیه صحبت می‌کنید؟",
  "کمتر از بقیه صحبت می‌کنید؟",
  "دیگران را معرفی می‌کنید؟ ",
  "معرفی می‌شوید؟",
  "در این مورد با شخصی صحبت کنید؟",
  "در مورد آن خوب فکر می‌کنید؟",
  "خیلی سریع",
  "تنها پس از آنکه شما را خوب شناختند",
  "بیشتر از آنچه می‌گویید می‌باشد؟",
  "کمتر از آنچه می‌گویید است؟",
  "برایتان خوشایند یا دست کم راحت است؟",
  "زحمت زیادی برایتان دارد؟",
  "آن را مطرح می‌کنید؟",
  "در مورد گفتن آن تردید دارید؟",
  "فردی اهل عمل؟",
  "فردی مبتکر و خلاق؟",
  "از شیوه‌ی بیان عجیب و ابتکاری مطالب لذت می‌برید؟",
  "نویسندگانی را دوست دارید که به روشنی منظور خود را می‌رسانید؟",
  "واقعیت‌ها را تدریس کنید؟",
  "نظریه‌ها را شرح دهید؟",
  "با فردی تخیلی",
  "با فردی واقع‌بین",
  "آن را به شیوه‌ی پذیرفته شده انجام دهید؟",
  "روش خاص خود را برای انجام آن ابداع کنید؟",
  "متفاوت باشید؟",
  "متعارف عمل کنید؟",
  "عبارت",
  "مفهوم",
  "ساختن",
  "اختراع کردن",
  "واقعی",
  "انتزاعی",
  "حروفی",
  "ارقامی",
  "تولید",
  "طراحی",
  "علامت",
  "نماد",
  "پذیرش",
  "تغییر",
  "شناخته شده",
  "ناشناخته",
  "واقعیت‌ها",
  "ایده‌ها",
  "زیربنا",
  "روبنا",
  "نظریه",
  "تجربه",
  "مایع",
  "جامد",
  "بصیرت دارد",
  "عقل سلیم دارد",
  "درخواست شما خلاصه و تجاری است؟",
  "درخواست شما دوستانه و اجتماعی است؟",
  "شخصی با احساسات واقعی",
  "شخصی همیشه منطقی",
  "قلبتان بر عقلتان غلبه دارد؟",
  "عقلتان بر قلبتان غلبه دارد؟",
  "تمجید کنید؟",
  "سرزنش کنید؟",
  "همدردی نکردن",
  "استدلال‌پذیر نبودن",
  "مردم خیلی دوست دارند که شما آن را انجام دهید",
  "این منطقی‌ترین کاری است که انجام می‌دهید",
  "خیلی احساساتی بودن",
  "به اندازه کافی احساساتی نبودن",
  "گرمی زیاد نشان دادن",
  "به اندازه کافی گرم نبودن",
  "برای احساس بیشتر از منطق ارزش قائل هستید؟",
  "برای منطق بیشتر از احساس ارزش قائل هستید؟",
  "متقاعدکردن",
  "لمس‌کردن",
  "موافقت‌کردن",
  "پرسیدن",
  "مزایا",
  "برکت",
  "تحلیل‌کردن",
  "همدردی",
  "نرم",
  "سخت",
  "پایبند به اندیشه خود",
  "دلگرم",
  "چه کسی",
  "چه چیزی",
  "محتاط",
  "خوش‌خیال",
  "ملایم",
  "محکم",
  "عدالت",
  "بخشندگی",
  "غیرانتقادی",
  "انتقادی",
  "متفکر",
  "احساسی",
  "دلسوزی",
  "دوراندیشی",
  "احساسات افراد",
  "حقوق افراد",
  "به مردم بیشتر از اشیاء علاقه‌مندید؟",
  "به اشیاء و نحوه کار آن‌ها بیشتر از روابط انسان‌ها علاقه‌مندید؟",
  "آن را زود شروع می‎کنید بطوریکه پس از پایان کار وقت اضافی داشته باشید؟",
  "آن را به لحظه آخر واگذارکرده و سعی می‌کنید هر چه سریع‌تر انجام دهید؟",
  "آیا بوجود آمدن وقفه در برنامه‌تان را مزاحمت تلقی می‌نمایید؟",
  "با تغییر وضعیت بوجود آمده با خوشرویی برخورد می‌کنید؟",
  "مورد رضایت شماست؟",
  "شما را در تنگنا قرار می‌دهد؟",
  "زمانی را برای تهیه‌ی فهرستی از کارهایی که می‌بایست انجام شوند، براساس اولویت در نظر می‌گیرید؟",
  "دل به دریا می‌زنید و شروع می‌کنید؟",
  "طبق برنامه عمل کردن برای شما خوشایند است؟",
  "از در چهار چوب قرار گرفتن احساس ناخوشایندی می‌کنید؟",
  "قرار ملاقات‌ها، وعده‌ها و میهمانی‌ها را از پیش تعیین کنید؟",
  "فردی باشید که در لحظه آخر بتوانید آزادانه آنجایی را که تمایل دارید انتخاب کنید؟",
  "ترجیح می‌دهید کارها را در دقیقه آخر انجام دهید؟",
  "انجام دادن کارها در دقیقه آخر شما را عصبی می‌کند؟",
  "راحت‌ترین روش برای انجام دادن کارها است؟",
  "حتی اگر ضروری باشد رنج آور است؟",
  "پیش از آغاز کار، با دقت آن را سازماندهی کنید؟",
  "آنچه ضروری است را حین انجام کار متوجه شوید؟",
  "روزمره بودن برایتان ساده‌تر است؟",
  "متنوع بودن؟",
  "آیا می‌دانید کار بعدی چیست و آماده درگیر شدن با آن هستید؟",
  "تا پیشامد بعدی از آرامش خود خوشنود هستید؟",
  "وقت‌شناس",
  "بی‌دغدغه",
  "منضبط",
  "آسان‌گیر",
  "منظم",
  "خودمانی",
  "برنامه‌ریز",
  "بی‌برنامه",
  "برای دیدار کسی از قبل برنامه‌ریزی کنید؟",
  "آزاد باشید و لحظه‌ای عمل کنید؟",
  "برای اینکه چه کاری و چه موقع انجام دهید برنامه‌ریزی کنید؟",
  "فقط می‌روید؟",
  "ابتدای صبح همه کارها را انجام دهید؟",
  "در ضمن فرصت پیش آمده حین انجام کارهای جالب، آن‌ها را انجام می‌دهید؟",
  "از اتمام کارها پیش از زمان موعود احساس رضایت می‌کنید؟",
  "از سرعت و کارآمدی خود در لحظات آخر انجام کار لذت می‌برید؟",
  "خیلی سوال کنید؟",
  "کم سوال کنید؟",
];

//calculating results

startTest();
