const question = document.getElementById("question");
const questionNumber = document.getElementById("question-number");
const choices = Array.from(document.getElementsByClassName("choice-text"));
const progressBarFull = document.getElementById("progressBarFull");
const progressBar = document.getElementById("progressBar");
const previousQuestionBtn = document.getElementById("previousQuestionBtn");

let currentQuestion = {};
let acceptingAnswers = false;
let score = 0;
let questionCounter = 0;
let availableQuestions = [];
let answers = [];

for (var i = 0; i < 250; i++) {
  answers.push(0);
}

let questions = [
  "من اصولا شخص نگرانی نيستم",
  "بیشتر افرادی را که با آن‌ها درتماس هستم واقعا دوست دارم",
  "من قدرت تخیل و تصور خیلی زنده و فعالی دارم",
  "من معمولا در مورد قصد و نیت دیگران بدبین و بد گمان هستم",
  "من به محتاط بودن و داشتن عقل سلیم، مشهورم",
  "من از نحوه برخورد دیگران با خودم عصبانی می‌شوم",
  "من معمولا از جمعیت‌های بزرگ و شلوغ دوری و پرهیز می‌کنم",
  "مسائل و مطالب مربوط به هنر و زیبا‌شناسی برای من اهمیت چندانی ندارند",
  "من آدم حیله‌گر و مکاری نیستم",
  "من ترجیح می‌دهم با ذهن باز به استقبال اتفاقات آینده بروم تا اینکه برای هر کاری طرح و نقشه قبلی داشته باشم",
  "من به ندرت احساس تنهایی و غمگینی می‌کنم",
  "من آدمی مسلط، قوی و قاطع هستم",
  "بدون هیجانات قوی، زندگی برای من چیز جالبی نخواهد بود",
  "بعضی از مردم من را آدمی خودخواه و خود محور می‌دانند",
  "من سعی می‌کنم تا وظایف محوله به خود را با صداقت و درستی انجام دهم",
  "من در معامله با مردم همیشه از این می‌ترسم که نکند مرتکب اشتباه بزرگی شوم",
  "من در موقع کار یا تفریح عجله و شتاب به خرج نمی‌دهم",
  "من در کارهای خود از روش نسبتا ثابت و جا افتاده‌ای پیروی می‌کنم",
  "من ترجیح می‌دهم با دیگران همکاری کنم تا این که با آنان به رقابت بپردازم",
  "من آدم راحت طلب و تنبلی هستم",
  "من به ندرت در کارها زیاده‌روی می‌کنم",
  "من اغلب تشنه هیجان و تحریک هستم",
  "من اغلب از بازی‌کردن با نظریه‌ها و افکار انتزاعی لذت می‌برم",
  "من از لاف‌زدن درباره استعدادها و موفقیت‌های خودم بدم نمی‌آید",
  "من به خوبی می‌توانم وقت و فعالیت خودم را طوری تنظیم کنم که کارهای محوله به موقع تمام شود",
  "من اغلب احساس درماندگی و ناتوانی می‌کنم و میل‌دارم شخص دیگری مسائلم را حل کند",
  "من هرگز آنقدر احساس خوشحالی نکرده‌ام که به اصطلاح از خوشی به هوا بپرم",
  "فکر می‌کنم آموزش مطالب متناقض به دانشجویان فقط باعث سردرگمی و انحراف فکری بیشتر آنان خواهد‌شد",
  "رهبران سیاسی باید درباره جنبه‌های انسانی برنامه‌های خود آگاهی بیشتری داشته باشند",
  "در طی سال‌ها، من بعضی کارهای کاملا بی‌ربط انجام داده‌ام",
  "من به آسانی دچار ترس می‌شوم",
  "من از صحبت کردن با دیگران چندان لذت نمی‌برم",
  "من سعی می‌کنم همه افکارم را در راستای واقعیت‌ها هدایت کنم و از پناه بردن به عالم رویا و تخیل خودداری می‌نمایم",
  "من معتقدم اکثر مردم اساسا دارای قصد و نیت خوب و دوستانه‌ای هستند",
  "من مسئولیت‌های اجتماعی از قبیل رای دادن را خیلی جدی نمی‌گیرم",
  "خلق و روحیه من بیشتر وقت‌ها ثابت است و زیاد بالا و پایین نمی‌رود",
  "من دوست دارم همیشه افراد زیادی دور و برم باشند",
  "من بعضی مواقع در موسیقی‌ای که گوش می‌دهم غرق می‌شوم",
  "اگر نیاز باشد حاضرم از افراد دیگر برای رسیدن به مقاصد خود سوء استفاده کنم",
  "من اشیاء متعلق به خود را تمیز و پاکیزه نگه می‌دارم",
  "من بعضی وقت‌ها کاملا احساس بی‌ارزشی می‌کنم",
  "من گاهی نمی‌توانم آن طور که باید از خود قاطعیت نشان دهم",
  "من به ندرت دچار احساسات و عواطف قوی می‌شوم",
  "من سعی می‌کنم با همه افرادی که ملاقات می‌کنم، رفتاری مودب و با نزاکت داشته باشم",
  "گاهی من آن طور که باید صادق و قابل اعتماد نیستم",
  "من وقتی با افراد دیگری هستم به ندرت احساس خجالت می‌کنم",
  "من وقتی کاری را انجام می‌دهم، آن را با تمام علاقه و سرعت انجام می‌دهم",
  "من فکر می‌کنم یادگرفتن و تمرین سرگرمی‌ها و کارهای ذوقی جدید جالب است",
  "در مواردی که لازم باشد، من می‌توانم از دیگران ایراد بگیرم و به آنها کنایه بزنم",
  "من دارای اهداف و روشن مشخصی هستم و برای دستیابی به آن‌ها طبق برنامه منظمی عمل می‌کنم",
  "مقاومت در برابر خواسته‌ها و هوس‌های آنی برای من آسان نیست",
  "من از گذراندن تعطیلات خود در جاهای شلوغ و پر هیجان لذت نمی‌برم",
  "من بحث و استدلال درباره مطالب فلسفی را کاری بی‌فایده و کسل‌کننده می‌دانم",
  "من ترجیح می‌دهم که در مورد خودم و موقعیت‌هایم حرفی نزنم",
  "من قبل از شروع به هر کاری مقدار زیادی وقت تلف می‌کنم",
  "احساس می‌کنم قادر هستم با بسیاری از مشکلات خود کنار بیایم",
  "من بعضی وقت‌ها حالات شادی یا نشاط بسیار شدیدی را احساس کرده‌ام",
  "به نظر من قوانین و سیاست‌های اجتماعی باید مطابق با نياز‌های زمان که در حال تغییر است تحول پيدا کنند",
  "من از لحاظ نگرش‌های اجتماعی آدمی سختگیر و بی‌گذشت هستم",
  "من قبل از این که تصمیمی بگیرم، در مورد جوانب مختلف مساله به دقت فکر می‌کنم",
  "من به ندرت احساس ترس و اضطراب می‌کنم",
  "من به آدمی خونگرم و خوش رو معرف هستم",
  "من زندگی تخیلی بسیار فعالی دارم",
  "من عقيده دارم که اکثر مردم اگر به آنها اجازه داده شود، از آدم سوء استفاده خواهند کرد",
  "من خود را درباره حوادث جاری مطلع نگه می‌دارم و معمولا تصمیمات عاقلانه اتخاذ می‌کنم",
  "من به آدم جوشی و عصبی معرف هستم",
  "من معمولا ترجیح می‌دهم کارها را به تنهایی انجام دهم",
  "گوش دادن به موسيقی‌هاي کلاسيک و يا سنتی برايم خسته کننده است",
  "من حتی اگر بخواهم نمی‌توانم کسی را فريب دهم",
  "من آدم بسیار منظم و با برنامه‌ای نیستم",
  "من به ندرت افسرده و غمگین می‌شوم",
  "من غالبا در گروه‌هایی که عضو بوده‌ام سمت رهبری را بر عهده داشته‌ام",
  "اينکه راجع به موضوعات چه احساسی دارم برایم مهم است",
  "بعضی افراد فکر می‌کنند من آدم فاقد احساسات و حسابگری هستم",
  "من بدهی‌های خود را به موقع و به طور کامل می‌پردازم",
  "بعضی وقت‌ها طوری احساس خجالت کرده‌ام که دلم می‌خواسته خودم را از دیگران پنهان کنم",
  "ممکن است کار من کند باشد ولی با ثبات و یکنواخت است",
  "وقتی که روش صحیح انجام دادن کار را یافتم، آن را همواره دنبال می‌کنم",
  "در نشان دادن خشم و عصبانیت درنگ و تامل می‌کنم، حتی اگر احساس کنم حق با من است",
  "هرگاه برنامه‌ای برای اصلاح پاره‌ای از رفتارهای خود شروع کنم معمولا بعد از چند روز آن را کنار می‌گذارم",
  "مقاومت در برابر وسوسه‌ها و خواهش‌های نفسانی برای من مشکل نیست",
  "من بعضی وقت‌ها کارهایی را انجام داده‌ام که هدف آن‌ها فقط هیجان و لذت بردن بوده‌است",
  "من از حل جدول و معما لذت می‌برم",
  "من از بیشتر مردم بهتر هستم و این را می‌دانم",
  "آدم سازنده و مولدی هستم و همیشه مسئولیت‌های خود را به انجام می‌رسانم",
  "بعضی مواقع وقتی که تحت فشار روانی زیاد هستم، احساس می‌کنم که دارم خورد می‌شوم",
  "من آدم خوشحال و امیدواری نیستم",
  "من معتقدم که برای اخذ تصمیم درباره موضوعات اخلاقی باید از رهبران مذهبی خود کسب تکلیف و تقلید کنیم",
  "ما هرگز نمی‌توانيم برای افراد فقير و سالمند کار زيادی بکنيم",
  "گاهی اول عمل می‌کنم و بعد می‌اندیشم",
  "من اغلب دچار تنش بوده و عصبی هستم",
  "بیشتر مردم مرا فردی سرد و غیر صميمی می‌دانند",
  "من دوست ندارم وقتم را با خیالبافی تلف کنم",
  "فکر می‌کنم بیشتر مردمی که با آن‌ها در تماس هستم، افرادی درستکار و قابل اطمینان هستند",
  "من غالبا بدون آمادگی کافی در موقعیت‌های مختلف حاضر می‌شوم",
  "بیشتر مردم مرا آدمی زود رنج و بداخلاق نمی‌دانند",
  "اگر برای مدت طولانی تنها باشم، واقعا احساس می‌کنم به افراد دیگر نیازمند هستم",
  "نظم و ترتیب خاصی که در هنر و طبیعت می‌بینم برای من بسیار جالب و شوق انگیز است",
  "کاملا صادق و درستکار بودن برای تجارت و کاسبی خوب نیست",
  "دوست دارم هر چیزی را در جای مخصوص آن نگهدارم تا بعدا به راحتی به آن دسترسی داشته‌باشم",
  "من گاهی دچار احساس پشیمانی و گناهکاری شدید شده‌ام",
  "در جلسات جمعی من می‌گذارم دیگران بیشتر حرف‌ها را بزنند",
  "به ندرت به احساس آنی خودم توجه می‌کنم",
  "من غالبا سعی می‌کنم نسبت به افکار و احساسات دیگران آگاهی و احترام نشان دهم",
  "من گاهی دربازی شطرنج یا ورزش تقلب می‌کنم",
  "اگر ديگران سر به سر من بگذارند و با من شوخی کنند زياد ناراحت نمی‌شوم",
  "من اغلب احساس می‌کنم که سرشار از نیرو و توان هستم",
  "من اغلب غذاهای جدید و نا‌آشنا را امتحان می‌کنم",
  "من اگر اشخاصی را دوست نداشته باشم برايم مهم نيست که متوجه شوند",
  "من برای دستیابی به اهداف خود سخت تلاش می‌کنم",
  "وقتی به غذای مورد علاقه‌ام دسترسی پیدا کنم غالبا بیش از حد معمول می‌خورم",
  "سعی می‌کنم فيلم‌های ترسناک و تکان‌دهنده را نبينم",
  "بعضی مواقع که مردم در مورد مسائل خیلی انتزاعی و نظری صحبت می‌کنند من حوصله‌ام سر می‌رود",
  "من سعی می‌کنم آدم افتاده و فروتنی باشم",
  "من به زحمت می‌توانم خود را وادار به کاری کنم که باید انجام دهم",
  "من در مواقع اضطراری می‌توانم خونسردی خودم را حفظ کنم",
  "من گاهی بیش از اندازه احساس خوشبختی می‌کنم",
  "من معتقدم که عقاید متفاوت افراد جوامع دیگر در مورد حق و ناحق برای خود آن جامعه اعتبار و ارزش دارد",
  "من در مورد آدم‌هایی که در خیابان‌ها گدایی می‌کنند هیچ گونه اخساس همدردی نمی‌کنم",
  "من همیشه قبل از اینکه دست به عملی بزنم پیامدهای آن را مورد توجه قرار می‌دهم",
  "من به ندرت درباره آینده احساس ترس و نگرانی می‌کنم",
  "من واقعا از صحبت کردن با دیگران لذت می‌برم",
  "از تمرکز بر يک موضوع خيالی و بررسی تمام جنبه‌ها و شاخ و برگ دادن به آن لذت می‌برم",
  "هرگاه شخصی در مورد من کار خوبی انجام می‌دهد نسبت به او احساس بدگمانی و سوء‌ظن می‌کنم",
  "من به خاطر درستی قضاوتم به خود می‌بالم",
  "من اغلب نسبت به افرادی که با آن‌ها سروکار دارم احساس تنفر و بیزاری می‌کنم",
  "من کارهایی را ترجیح می‌دهم که بتوانم به تنهایی و بدون تحمل مزاحمت دیگران انجام دهم",
  "شعر تاثیر چندانی روی من ندارد",
  "از این که به عنوان آدم ریاکاری شناخته شوم متنفرم",
  "به نظر نمی‌رسد که هرگز بتوانم کارهای خود را نظم و ترتیب بدهم",
  "هرگاه اشتباهی رخ دهد یا عیب و ایرادی پیش بیاید من خودم را سرزنش می‌کنم",
  "ساير افراد غالبا برای تصميم‌گيری به من نگاه می‌کنند",
  "هیجانات و احساسات گوناگونی به من دست می‌دهد",
  "من به سخاوت و دست و دلبازی مشهور نیستم",
  "همیشه وقتی قول انجام دادن کاری را می‌دهم مردم می‌توانند به انجام گرفتن آن کار اطمینان کنند",
  "من اغلب نسبت به دیگران احساس حقارت می‌کنم",
  "من به اندازه دیگران چابک و سرزنده نیستم",
  "ترجیح می‌دهم وقتم را در محیط‌های مانوس و آشنا بگذرانم",
  "وقتی شخصی به من توهین‌کند من فقط سعی می‌کنم او را ببخشم و فراموش کنم",
  "من احساس نمی‌کنم که مجبورم با دیگران رقابت نموده و از آنان بهتر باشم",
  "من به ندرت در مقابل خواسته‌های آنی خود تسلیم می‌شوم",
  "من ترجیح می‌دهم در جاهایی باشم که کانون فعالیت و عمل است",
  "من از سرو کله زدن با مسائل و معماهایی که ذهن آدم را به کوشش و چالش وادار می‌کند لذت می‌برم",
  "من در مورد خودم نظر بسیار مثبتی دارم",
  "وقتی کاری را شروع می‌کنم تقريبا همیشه آن را به اتمام می‌رسانم",
  "غالبا تصمیم‌گرفتن و اتخاذ یک روش قطعی برای من مشکل است",
  "من خودم را فردی خیلی سرزنده و سرحال نمی‌دانم",
  "من معتقدم که وفاداری به اصول و ايده‌آل‌های شخصی، بسيار مهم‌تر از آزادانديشی و نداشتن تعصب است",
  "نیازهای انسانی افراد همیشه باید بر ملاحظات اقتصادی مقدم باشد",
  "من غالبا کارها را بدون برنامه‌ريزی زمانی انجام می‌دهم",
  "من اغلب نگران این هستم که مبادا کارها طبق نقشه و به درستی پیش نروند",
  "لبخند زدن به افراد غریبه و برقراری ارتباط با آن‌ها برای من آسان است",
  "هر وقت احساس کنم ذهنم در جهت خیال‌پردازی می‌رود معمولا خودم را به کاری مشغول می‌کنم و به جای خیال‌پردازی، حواسم را روی آن کار متمرکز می‌سازم",
  "واکنش اولیه من نسبت به مردم آن است که به آن‌ها اعتماد کنم",
  "من ظاهرا در هیچ کاری موفق نمی‌شوم",
  "من خیلی به ندرت واقعا عصبانی می‌شوم",
  "ترجیح می‌دهم تعطیلات خود را در یک محل تفريحی شلوغ بگذرانم تا در يک کلبه جنگلی دور افتاده",
  "انواع خاصی از موسیقی بیش از اندازه برای من شورانگیز هستند",
  "بعضی وقت‌ها مردم را با چرب زبانی و تقلب به انجام دادن کارهای مورد نظر خودم وادار می‌کنم",
  "من معمولا آدمی کم رو و زیاد سختگیر و پرتوقع هستم",
  "من نسبت به خودم نظری منفی دارم",
  "ترجیح می‌دهم دنبال کارهای خودم را بگیرم تا این که رهبر گروه بشوم",
  "به ندرت متوجه احساسات و عواطفی حاصل از وضعيت‌های مختلف می‌شوم",
  "بیشتر مردمی که می‌شناسم مرا دوست دارند",
  "من دقیقا از اصول اخلاقی پیروی می‌کنم",
  "من در حضور روسای خود و دیگر افراد مهم و صاحب قدرت احساس آرامش و راحتی می‌کنم",
  "من معمولا در حال عجله به نظر می‌رسم",
  "بعضی مواقع تنها برای این که کار تازه‌ای انجام داده باشم محل اثاثیه خانه را تغییر می‌دهم",
  "اگر کسی با من شروع به دعوا و مرافعه کند من آماده‌ام جواب او را با دعوا بدهم",
  "من تلاش می‌کنم تمام چیزهایی را که می‌توانم، به دست آورم",
  "من گاهی آنقدر غذا می‌خورم که بالا می‌آورم",
  "من عاشق ترس هیجانی هستم که معمولا سوار شدن در چرخ و فلک یا کارهای خطرناک دیگر ایجاد می‌کند",
  "من علاقه‌ای به تامل و تفکر جدی درباره سرنوشت جهان یا انسان ندارم",
  "صرف نظر از اينکه ديگران چه وضعيت و شرايطي دارند احساس نمی‌کنم که از آن‌ها بهتر باشم",
  "وقتی در اجرای یک طرح یا نقشه با مشکل روبه‌رو می‌شوم تمایل پیدا می‌کنم طرح دیگری را شروع کنم",
  "در یک موقعیت بحرانی به خوبی می‌توانم خودم را کنترل و اداره کنم",
  "من آدم خوش مشرب، شاد و با روحیه‌ای هستم",
  "من خود را آدمی با سعه صدر می‌دانم که می‌تواند راه و رسم زندگی و طرز تفکر دیگران را به خوبی قبول نماید",
  "من معتقدم که همه انسان‌ها با ارزش و قابل احترام هستند",
  "من به ندرت تصمیمی عجولانه می‌گیرم",
  "در مقایسه با بیشتر مردم من از چیزهای کمتری می‌ترسم",
  "من به دوستان خود وابستگی عاطفی زیادی دارم",
  "در کودکی به ندرت از بازي‌هايی که جنبه نمايشی و تخيلی داشتند خوشم می‌آمد",
  "من معمولا در مورد افراد دیگر خوشبین هستم",
  "من فرد بسیار شایسته و کارایی هستم",
  "گاهی بداخلاق و ترش رو می‌شوم",
  "معمولا معاشرت و گردهمایی‌های اجتماعی برای من ناخوشایند و کسل‌کننده هستند",
  "بعضی مواقع که شعری را می‌خوانم یا به یک اثر هنری نگاه می‌کنم موجی از احساس افسردگی یا هیجان مرا دربر می‌گیرد",
  "من بعضی وقت‌ها با اعمال زور یا تملق و خوش‌آمدگویی مردم را به انجام دادن کارهای مورد نظرم وادار می‌کنم",
  "من در مورد تمیز کردن چیزها وسواس ندارم",
  "بعضی وقت‌ها زندگی به نظرم تیره و نا‌امید‌کننده می‌آید",
  "در موقع صحبت کردن با دیگران من غالبا بیشتر از دیگران حرف می‌زنم",
  "هم حس شدن با دیگران یعنی داشتن همان احساسی که دیگران دارند، برای من آسان است",
  "من خودم را آدم خیّر و نیکوکاری می‌دانم",
  "من سعی می‌کنم کارهای خودم را با دقت انجام دهم تا الزامی برای انجام دادن مجدد آن‌ها پیش نیاید",
  "اگر در مورد فردی حرف بدی زده یا کار غلطی انجام داده‌باشم به سختی می‌توانم بار دیگر به روی او نگاه کنم",
  "همه زندگی و کارهای من با سرعت انجام می‌شود",
  "در موقع استفاده از تعطیلات ترجیح مي‌دهم که به جاهایي آشنا و شناخته شده بروم",
  "سرسخت و لجوج هستم",
  "سعی می‌کنم همه کارهای خودم را به بهترین نحو انجام دهم",
  "من بعضی مواقع کارهایی را بدون تامل انجام می‌دهم و بعدا پشیمان می‌شوم",
  "من از رنگ‌های روشن و لباس‌های پر زرق و برق خوشم می‌آید",
  "من کنجکاوی فکری زیادی دارم",
  "من ترجیح می‌دهم از دیگران تمجید کنم تا این که خودم مورد تمجید قرار گیرم",
  "آنقدر خرده‌کاری برای انجام دادن کارها وجود دارد که گاهی همه آن‌ها را نادیده می‌گیرم",
  "در شرایطی که به نظر می‌رسد همه چیز به طور غلط پیش می‌رود، من بازهم می‌توانم تصمیمات خوبی اتخاذ کنم",
  "من به ندرت برای توصیف تجارب خود از کلماتی چون فوق العاده یا عالی استفاده می‌کنم",
  "فکر می‌کنم اگر شخصی در سن 25 سالگی هنوز نداند به چه چیزهایی اعتقاد دارد باید در سلامت او شک کرد",
  "نسبت به افرادی که کمتر از من خوشبخت هستند احساس همدردی می‌کنم",
  "من قبل از رفتن به یک مسافرت به دقت برنامه‌ریزی می‌کنم",
  "بعضی مواقع افکار ترسناکی به ذهن من می‌آیند",
  "نسبت به افرادی که با آن‌ها کار می‌کنم علاقه شخصی پيدا می‌کنم",
  "من نمی‌توانم اجازه دهم افکارم در هر جهتی که می‌خواهند سیر کنند",
  "من به طبیعت و ذات انسان بسیار اعتقاد دارم",
  "من در کار خود فردی موثر و کارآمد هستم",
  "حتی آزردگی و ناراحتی‌های خیلی کوچک می‌توانند در من احساس ناکامی و محرومیت کنند",
  "من از میهمانی‌های بزرگ و پر جمعیت لذت می‌برم",
  "از خواندن اشعار حاوی احساسات و تصورات بيشتر از داستان لذت می‌برم",
  "من از زیرکی خودم در کنترل و اداره مردم به خود می‌بالم",
  "من وقت زیادی را برای پیدا کردن اشیایی که در جایی اشتباهی گذاشته‌ام می‌گذرانم",
  "بیشتر وقت‌ها که کارها طبق نقشه پیش نمی‌روند یا اشتباه از آب در می‌آیند احساس دلسردی می‌کنم و می‌خواهم آن‌ها را ناتمام رها کنم",
  "قبول مسئولیت اداره یا رهبری یک موقعیت، برای من آسان نیست",
  "اشیای غیرعادی از قبیل بعضی عطرها یا اسامی مکان‌های دور می‌توانند احساسات و عواطف شدیدی را در من ایجاد کنند",
  "اگر بتوانم به دیگران کمک کنم به آسانی و بدون درخواست آن‌ها این کار را انجام می‌دهم",
  "من واقعا باید مریض باشم تا یک روز بر سر کار حاضر نشوم",
  "وقتی آشنایان من کار احمقانه‌ای را انجام می‌دهند، به جای آن‌ها من احساس خجالت می‌کنم",
  "من شخص بسیار فعالی هستم",
  "من وقتی به جایی می‌روم از همان مسیر همیشگی استفاده می‌کنم",
  "من اغلب با اعضای خانواده و همکارانم بگو مگو دارم",
  "من از جمله افراد معتاد به کار هستم که نمی‌توانند هرگز بیکار بنشینند",
  "من همیشه می‌توانم احساساتم را کنترل کنم",
  "در حوادث ورزشی دوست دارم جزیی از جمعیت باشم و مثل بقیه رفتار کنم",
  "من علائق فکری وسیع و متنوعی دارم",
  "من آدم مهم و برتری هستم",
  "شخص بسيار منظم و مرتبی هستم",
  "من از لحاظ عاطفی فردی کاملا باثبات و متعادل هستم",
  "من زود خنده‌ام می‌گیرد",
  "به عقیده من نظام اخلاقی جديد که اجازه هرکاری را به افراد می‌دهد اصلا روش اخلاقی خوبی نيست",
  "ترجیح می‌دهم فردی با رحم و با گذشت شناخته شوم تا يک فرد عادل",
  "من قبل از پاسخ دادن به هر سوال به دقت درباره آن فکر می‌کنم",
];

//CONSTANTS

const MAX_QUESTION = 240;

startTest = () => {
  questionCounter = 0;
  score = 0;
  getNewQuestion();
};

getNewQuestion = () => {
  if (questions.length === 0 || questionCounter >= MAX_QUESTION) {
    const body = {
      answerData: answers,
    };
    const string = JSON.stringify(body);

    fetch("/tests/answerDataNEOPIR", {
      method: "PATCH",
      headers: {
        "Content-Type": "application/json",
      },
      body: string,
    })
      .then((res) => res.json())
      .then((data) => {
        if (data.ok) {
          window.location.assign("/dashboard");
        } else {
          alert("اروری اتفاق افتاد ");
        }
      })
      .catch((err) => {
        console.log(err);
        alert("اروری اتفاق افتاد ");
      });
  }
  if (questionCounter < 1) {
    previousQuestionBtn.style.visibility = "hidden";
  }
  if (questionCounter >= 1) {
    previousQuestionBtn.style.visibility = "visible";
  }

  //filling the progress bar
  let progressBarFullWidth = (questionCounter / MAX_QUESTION) * 100 + "%";
  progressBarFull.style.width = progressBarFullWidth;

  //new text and number
  question.innerText = questions[questionCounter];
  questionNumber.innerText = questionCounter + 1;

  questionCounter++;

  acceptingAnswers = true;
};

choices.forEach((choice) => {
  choice.addEventListener("click", (e) => {
    if (!acceptingAnswers) return;

    acceptingAnswers = false;
    const selectedChoice = e.target;

    switch (selectedChoice.id) {
      case "choice1":
        answers[questionCounter - 1] = 6;
        break;
      case "choice2":
        answers[questionCounter - 1] = 5;
        break;
      case "choice3":
        answers[questionCounter - 1] = 4;
        break;
      case "choice4":
        answers[questionCounter - 1] = 3;
        break;
      case "choice5":
        answers[questionCounter - 1] = 2;
        break;
      case "choice6":
        answers[questionCounter - 1] = 1;
        break;
    }

    selectedChoice.parentElement.classList.add("chosen");

    setTimeout(() => {
      selectedChoice.parentElement.classList.remove("chosen");
      getNewQuestion();
    }, 250);
  });
});

previousQuestionBtn.addEventListener("click", (e) => {
  questionCounter -= 2;
  getNewQuestion();
});

//calculating results

startTest();
