const question = document.getElementById("question");
const questionNumber = document.getElementById("question-number");
const choices = Array.from(document.getElementsByClassName("choice-text"));
const progressBarFull = document.getElementById("progressBarFull");
const progressBar = document.getElementById("progressBar");
const previousQuestionBtn = document.getElementById("previousQuestionBtn");

let currentQuestion = {};
let acceptingAnswers = false;
let score = 0;
let questionCounter = 0;
let availableQuestions = [];
let answers = [];

for (var i = 0; i < 90; i++) {
  answers.push(0);
}

let questions = [
  "آیا از هفته گذشته تا به امروز سر دردهایی داشته‌اید؟",
  "آیا بی جهت دلشوره دارید و توی دلتان می‌لرزد؟",
  "آیا افکار مزاحمی‌که دوست ندارید مرتبا وارد سر شما می‌شوند که ولتان نکنند؟ (منظور افکار مزاحم و تکراری)",
  "آیا از هفته گذشته تا به امروز سر دردهایی داشته‌اید؟",
  "آیا بی جهت دلشوره دارید و توی دلتان می‌لرزد؟",
  "آیا افکار مزاحمی‌که دوست ندارید مرتبا وارد سر شما می‌شوند که ولتان نکنند؟ (منظور افکار مزاحم و تکراری)",
  "آیا ضعف می‌کنید و سرتان گیج می‌رود؟",
  "آیا علاقه خود را نسبت به فعالیت‌ها و لذت های جنسی از دست داده‌اید؟",
  "آیا ایراد گیر هستید؟",
  "آیا فکر می‌کنید که اختیار فکرهای شما به دست دیگران است یعنی افکار شما را دیگران کنترل می‌کنند و یا با دستگاه‌هایی از راه دور مغز یا فکر شما را در اختیار خود دارند؟",
  "آیا احساس می‌کنید بخاطر بیشتر گرفتاری‌های شما دیگران را باید سرزنش کرد؟",
  "آیا فراموش کار شده‌اید؟",
  "آیا از ریخت و پاشیدگی‌ها در اطراف و سر سری گرفتن‌های دیگران ناراحت می شوید؟",
  "آیا زود دلخور و عصبانی می‌شوید؟",
  "در هفته گذشته تا امروز در ناحیه قلب یا سینه احساس دردهایی داشته اید؟",
  "آیا از رفتن به جاهای وسیع و یا کوچه و بازار می‌ترسید؟",
  "آیا در هفته گذشته تا امروز خودتان را کم قوه حس می‌کنید و یا کند شده‌اید؟",
  ".آیا فکر اینکه به زندگیتان خاتمه بدهید به سرتان آمده است؟",
  "آیاصداهائی به گوش شما می‌رسد که دیگران آنها را نمی‌شنوند؟",
  "آیا لرزش دارید؟",
  "آیا احساس می‌کنید که به بیشتر مردم نمی توان اعتماد کرد؟",
  ".آیا بی اشتها شده‌اید؟",
  "آیا زود به گریه می‌افتید؟",
  "آیا در برابر جنس مخالف احساس ناراحتی می‌کنید و خجالت می‌کشید؟",
  "آیا احساس می‌کنید طوری گیر افتاده اید که نه راه پس دارید و نه راه پیش؟",
  "آیا ناگهان و بدون هیچ علتی می‌ترسید؟",
  "آیا ناگهان آنچنان از کوره در می‌روید که نمی‌توانید جلوی خودتان را بگیرید؟",
  "آیا می‌ترسید تنها از خانه بیرون بروید؟",
  "آیا خود را برای هر چیزی سرزنش می‌کنید؟",
  "آیا پشت درد دارید؟",
  "آیا احساس می‌کنید که کارهایتان پیشرفت نمی‌کند مثل اینکه گره در کارتان افتاده باشد؟",
  "آیا احساس تنهایی می‌کنید؟",
  ".آیا احساس غمگینی می‌کنید؟",
  ".آیا برای هر چیز کوچکی زیاد دل نگران می‌شوید؟",
  "آیا نسبت به همه چیز بی علاقه شده‌اید؟",
  "آیا همیشه احساس ترس می‌کنید؟",
  "آیا زود می‌رنجید؟ آیا حساس و زود رنج شده‌اید؟",
  "آیا دیگران از فکر های شما بدون اینکه به آنها بگویید با خبر می‌شوند؟",
  "آیا فکر می‌کنید که دیگران حرف شما را نمی‌فهمند و یا درد شما را حس نمی‌کنند؟ ( توضیح اینکه : با شما همدردی نمی‌کنند )؟",
  "آیا فکر می‌کنید که رفتار مردم نسبت به شما غیر دوستانه است ؛ یا آنکه شما را دوست ندارند؟",
  ".آیا برای اینکه کارها را درست انجام بدهید مجبور هستید خیلی آهسته کار کنید؟",
  "آیا قلبتان تند می‌زند؟ طپش دارد؟",
  ".آیا درهفته گذشته تا امروز حال تهوع یا دل آشوبی داسته‌اید؟",
  "در میان کسانی که مثل شما هستند احساس می‌کنید از آنها کمتر هستید؟",
  "آیا در عضلاتتان احساس کوفتگی می‌کنید؟",
  "آیا احساس می‌کنید که دیگران شما را زیر نظر دارند و یا درباره شما با دیگران حرف می‌زنند؟",
  "آیا دیر خوابتان می‌برد؟ خواب رفتن برایتان مشکل است؟",
  "وقتی کاری را انجام می دهید آیا مجبور هستید آن را چند بار تکرار کنید تا مطمئن شوید آن را درست انجام داده‌اید؟ ( مثلا در را چند بار امتحان کنید تا مطمئن شوید که بسته است )",
  "آیا تصمیم گرفتن برایتان مشکل است؟",
  "آیا از مسافرت با اتوبوس یا قطار یا هر وسیله نقلیه عمومی دیگر می‌ترسید؟",
  ".آیا دچار تنگی نفس شده اید؟ (نمی توانید راحت نفس بکشید)",
  ".آیا ناگهان احساس می‌کنید که گر گرفته اید ( داغ شده اید ) و یا یخ می‌کنید؟",
  "آیا مجبور هستید بعضی کارها را نکنید و یا بعضی جاها نروید یا دست به بعضی چیزها نزنید برای اینکه از آنها بی دلیل می‌ترسید؟ (کارها یا جاهایی یا چیزهایی که دیگران از آن نمی‌ترسند)",
  "آیا اتفاق می‌افتد حس کنید که نمی‌توانید فکر بکنید مثل اینکه سرتان از فکر خالی است؟",
  "آیا قسمت هایی از بدنتان خواب می رود یا گزگز ( سوزن سوزن ) می‌شود؟",
  "آیا گاهی احساس می‌کنید که چیزی راه گلویتان را گرفته است ( مثل اینکه بغض گلو یتان را گرفته باشد؟)",
  "آیا نسبت به آینده نا امید هستید؟",
  "آیا وقتی کاری را انجام می‌دهید برایتان مشکل است که تمام حواستان را جمع آن بکنید؟",
  "آیا در بعضی قسمتهای بدنتان احساس ضعف می‌کنید؟",
  ".آیا عصبی ( کم تحمل ) هستید و زود از جا در می‌روید؟",
  "آیا در دستها و پاهایتان احساس سنگینی می‌کنید؟",
  ".آیا فکرهای زیادی درباره مرگ و مردن دارید؟",
  "آیا پرخوری می‌کنید؟",
  "آیا وقتی توجه مردم به شما است یا درباره شما در حضور خودتان حرف می زنند ناراحت می‌شوید؟",
  "آیا بعضی وقت ها حس می‌کنید فکر هایتان مال خودتان نیست یا آنها را توی سرتان گذاشته‌اند؟",
  "آیا حس می‌کنید که میل شدیدی به کتک زدن و آسیب رساندن به دیگران دارید؟",
  "آیا صبح ها زودتر از آنچه که عادت داشته اید بیدار می‌شوید و دیگر خوابتان نمی‌برد؟",
  "آیا خود را مجبور به تکرار بعضی کارها مانند شستن ؛ شمردن یا دست زدن به چیزهایی می‌بینید؟",
  "آیا بد خواب هستید؟ ناراحت می‌خوابید؟",
  "آیا گاهی حس می‌کنید که دلتان می خواهد چیزی را پرت کنید ؛ خرد کنید ؛ بشکنید؟",
  "آیا فکر ها و عقیدها ی مخصوص به خودتان را دارید که هیچکس دیگری آنها را قبول ندارد؟",
  "آیا وقتی با دیگران هستید زیاده از حد در فکر و رفتارتان مراقب هستید که مبادا کاری کنید که آبرویتان برود؟ (مبادا خطائی از شما سر بزند)",
  "آیا وقتی در جمع مردم هستید احساس ناراحتی و غریبگی می‌کنید مثل اینکه با آنها فرق دارید یا اینکه از آنها خجالت می‌کشید؟",
  "آیا انجام هر کاری به نظرتان مشکل و پر زحمت می‌آید؟",
  "آیا نا گهان دچار هول شدید و وحشت زدگی می‌شوید؟",
  "آیا در بین جمعیت از اینکه چیزی بخورید و یا بیاشامید ناراحت می‌شوید؟",
  "آیا زیادی درگیر می شوید و جرو بحث می‌کنید؟",
  "آیا وقتی تنها می مانید مضطرب می شوید؟ می‌ترسید؟",
  "آیا دیگران قدر و قیمت شما را نمی‌دانند؟",
  "آیا در میان جمع هم خود را تنها حس می‌کنید؟",
  "این روزها طوری بی قرار و نا آرام می شوید که نمی توانید یک جا بنشیند؟",
  "آیا فکر می‌کنید که آدم به درد نخور و بی ارزشی شده‌اید؟",
  ".آیا احساس می‌کنید چیزهای آشنا ( قیافه های – یا مناظر آشنا ) بنظرتان ناآشنا است؟",
  "آیا زود داد و فریاد راه می‌اندازید و چیزها را پرت می‌کنید؟",
  "آیا می‌ترسید که در انظار مردم غش کنید و بیفتید؟",
  "آیا حس می‌کنید که اگر به دیگران زیاد رو بدهید از شما سوء استفاده کنند؟",
  ".آیا افکاری در رابطه با مسائل جنسی دارید که بیش از اندازه شما را ناراحت می‌کند؟",
  "آیا فکر می‌کنید که آنقدر گنهکارید که باید عذاب و عقوبت ببینید؟",
  ".آیا احساس می‌کنید که مجبور هستید کارهایی را انجام بدهید؟( آیا فکرها و شکلهای خیالی ترسناک به سراغ شما می آید )",
  "آیا خیال می‌کنید عیب و نقص یا اختلال عمدهای در بدنتان پیدا شده است؟",
  "آیا نزدیک و صمیمی شدن با افراد برایتان خیلی مشکل است؟",
  "آیا بیشتر اوقات احساس تقصیر و گناه می‌کنید؟",
  "احساس می‌کنید دارای یکنوع ناراحتی روانی هستید یا چیزی ذهن شما را آزار می دهد؟",
];

//CONSTANTS

const MAX_QUESTION = 90;

startTest = () => {
  questionCounter = 0;
  score = 0;
  getNewQuestion();
};

getNewQuestion = () => {
  if (questions.length === 0 || questionCounter >= MAX_QUESTION) {
    const body = {
      answerData: answers,
    };
    const string = JSON.stringify(body);

    fetch("/tests/answerDataScl", {
      method: "PATCH",
      headers: {
        "Content-Type": "application/json",
      },
      body: string,
    })
      .then((res) => res.json())
      .then((data) => {
        if (data.ok) {
          window.location.assign("/dashboard");
        } else {
          alert("اروری اتفاق افتاد ");
        }
      })
      .catch((err) => {
        console.log(err);
        alert("اروری اتفاق افتاد ");
      });
  }
  if (questionCounter < 1) {
    previousQuestionBtn.style.visibility = "hidden";
  }
  if (questionCounter >= 1) {
    previousQuestionBtn.style.visibility = "visible";
  }

  //filling the progress bar
  let progressBarFullWidth = questionCounter / 3 + "rem";
  progressBarFull.style.width = progressBarFullWidth;

  //new text and number
  question.innerText = questions[questionCounter];
  questionNumber.innerText = questionCounter + 1;

  questionCounter++;
  acceptingAnswers = true;
};

choices.forEach((choice) => {
  choice.addEventListener("click", (e) => {
    if (!acceptingAnswers) return;

    acceptingAnswers = false;
    const selectedChoice = e.target;
    switch (selectedChoice.id) {
      case "choice1":
        answers[questionCounter - 1] = 1;
        break;
      case "choice2":
        answers[questionCounter - 1] = 2;
        break;
      case "choice3":
        answers[questionCounter - 1] = 3;
        break;
      case "choice4":
        answers[questionCounter - 1] = 4;
        break;
      case "choice5":
        answers[questionCounter - 1] = 5;
        break;
    }
    selectedChoice.parentElement.classList.add("chosen");

    setTimeout(() => {
      selectedChoice.parentElement.classList.remove("chosen");
      getNewQuestion();
    }, 500);
  });
});

previousQuestionBtn.addEventListener("click", (e) => {
  questionCounter -= 2;
  getNewQuestion();
});

startTest();
